bluestore/fourjobs/randread-1M.out
ceph-fuse-replicated: (g=0): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-fuse-erasure_1: (g=1): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-fuse-erasure_2: (g=2): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-kern-replicated: (g=3): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-kern-erasure_1: (g=4): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-kern-erasure_2: (g=5): rw=randread, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 24 processes

ceph-fuse-replicated: (groupid=0, jobs=4): err= 0: pid=8290: Wed Feb 28 13:36:48 2018
  read : io=2393.0MB, bw=40810KB/s, iops=39, runt= 60045msec
    slat (msec): min=19, max=798, avg=100.31, stdev=96.82
    clat (usec): min=14, max=4935.4K, avg=3033794.71, stdev=706231.84
     lat (msec): min=44, max=5037, avg=3134.11, stdev=714.47
    clat percentiles (msec):
     |  1.00th=[  766],  5.00th=[ 1991], 10.00th=[ 2278], 20.00th=[ 2507],
     | 30.00th=[ 2671], 40.00th=[ 2835], 50.00th=[ 2999], 60.00th=[ 3195],
     | 70.00th=[ 3392], 80.00th=[ 3654], 90.00th=[ 3949], 95.00th=[ 4178],
     | 99.00th=[ 4490], 99.50th=[ 4555], 99.90th=[ 4817], 99.95th=[ 4883],
     | 99.99th=[ 4948]
    bw (KB  /s): min= 2659, max=21787, per=18.38%, avg=7501.19, stdev=3806.99
    lat (usec) : 20=0.17%
    lat (msec) : 50=0.04%, 100=0.08%, 250=0.13%, 500=0.25%, 750=0.25%
    lat (msec) : 1000=0.59%, 2000=3.51%, >=2000=94.99%
  cpu          : usr=0.04%, sys=0.43%, ctx=19174, majf=0, minf=32861
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=2.7%, 32=94.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.2%, 64=0.0%, >=64=0.0%
     issued    : total=r=2393/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_1: (groupid=1, jobs=4): err= 0: pid=8348: Wed Feb 28 13:36:48 2018
  read : io=1593.0MB, bw=27136KB/s, iops=26, runt= 60114msec
    slat (msec): min=35, max=639, avg=150.88, stdev=108.43
    clat (usec): min=14, max=7029.7K, avg=4458362.42, stdev=1020628.19
     lat (msec): min=243, max=7097, avg=4609.24, stdev=1030.54
    clat percentiles (msec):
     |  1.00th=[  510],  5.00th=[ 2507], 10.00th=[ 3556], 20.00th=[ 3916],
     | 30.00th=[ 4178], 40.00th=[ 4424], 50.00th=[ 4555], 60.00th=[ 4752],
     | 70.00th=[ 4948], 80.00th=[ 5080], 90.00th=[ 5538], 95.00th=[ 5866],
     | 99.00th=[ 6259], 99.50th=[ 6521], 99.90th=[ 6849], 99.95th=[ 7046],
     | 99.99th=[ 7046]
    bw (KB  /s): min= 3230, max=16842, per=22.93%, avg=6221.90, stdev=2981.36
    lat (usec) : 20=0.25%
    lat (msec) : 250=0.06%, 500=0.63%, 750=0.50%, 1000=0.56%, 2000=2.01%
    lat (msec) : >=2000=95.98%
  cpu          : usr=0.03%, sys=0.29%, ctx=12768, majf=0, minf=32856
  IO depths    : 1=0.3%, 2=0.5%, 4=1.0%, 8=2.0%, 16=4.0%, 32=92.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.7%, 8=0.0%, 16=0.0%, 32=0.3%, 64=0.0%, >=64=0.0%
     issued    : total=r=1593/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_2: (groupid=2, jobs=4): err= 0: pid=8549: Wed Feb 28 13:36:48 2018
  read : io=1934.0MB, bw=32995KB/s, iops=32, runt= 60021msec
    slat (msec): min=33, max=543, avg=124.09, stdev=85.80
    clat (usec): min=14, max=5527.2K, avg=3703713.60, stdev=816200.77
     lat (msec): min=52, max=5622, avg=3827.81, stdev=823.69
    clat percentiles (msec):
     |  1.00th=[  412],  5.00th=[ 2278], 10.00th=[ 2999], 20.00th=[ 3294],
     | 30.00th=[ 3490], 40.00th=[ 3621], 50.00th=[ 3785], 60.00th=[ 3916],
     | 70.00th=[ 4113], 80.00th=[ 4228], 90.00th=[ 4555], 95.00th=[ 4817],
     | 99.00th=[ 5211], 99.50th=[ 5276], 99.90th=[ 5473], 99.95th=[ 5538],
     | 99.99th=[ 5538]
    bw (KB  /s): min= 2547, max=13368, per=17.04%, avg=5623.11, stdev=2476.31
    lat (usec) : 20=0.21%
    lat (msec) : 100=0.16%, 250=0.36%, 500=0.52%, 750=0.47%, 1000=0.62%
    lat (msec) : 2000=1.91%, >=2000=95.76%
  cpu          : usr=0.04%, sys=0.34%, ctx=15498, majf=0, minf=32857
  IO depths    : 1=0.2%, 2=0.4%, 4=0.8%, 8=1.7%, 16=3.3%, 32=93.6%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.2%, 64=0.0%, >=64=0.0%
     issued    : total=r=1934/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-replicated: (groupid=3, jobs=4): err= 0: pid=8680: Wed Feb 28 13:36:48 2018
  read : io=6420.0MB, bw=103565KB/s, iops=101, runt= 63478msec
    slat (usec): min=41, max=11765, avg=155.87, stdev=198.82
    clat (msec): min=9, max=14704, avg=1261.27, stdev=2854.66
     lat (msec): min=9, max=14704, avg=1261.43, stdev=2854.65
    clat percentiles (msec):
     |  1.00th=[   31],  5.00th=[   40], 10.00th=[   47], 20.00th=[   59],
     | 30.00th=[   74], 40.00th=[   95], 50.00th=[  135], 60.00th=[  227],
     | 70.00th=[  644], 80.00th=[ 1205], 90.00th=[ 3064], 95.00th=[10159],
     | 99.00th=[12911], 99.50th=[13173], 99.90th=[14353], 99.95th=[14484],
     | 99.99th=[14746]
    bw (KB  /s): min= 3011, max=59136, per=20.09%, avg=20807.67, stdev=9912.09
    lat (msec) : 10=0.03%, 20=0.02%, 50=12.80%, 100=28.79%, 250=19.61%
    lat (msec) : 500=5.58%, 750=6.71%, 1000=3.86%, 2000=8.33%, >=2000=14.27%
  cpu          : usr=0.07%, sys=0.31%, ctx=10193, majf=0, minf=32863
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.5%, 16=1.0%, 32=98.1%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=6420/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=4, jobs=4): err= 0: pid=8818: Wed Feb 28 13:36:48 2018
  read : io=4927.0MB, bw=81504KB/s, iops=79, runt= 61902msec
    slat (usec): min=53, max=5087, avg=193.98, stdev=162.91
    clat (msec): min=21, max=21007, avg=1605.55, stdev=4026.59
     lat (msec): min=21, max=21007, avg=1605.74, stdev=4026.58
    clat percentiles (msec):
     |  1.00th=[   26],  5.00th=[   37], 10.00th=[   48], 20.00th=[   73],
     | 30.00th=[  109], 40.00th=[  153], 50.00th=[  221], 60.00th=[  322],
     | 70.00th=[  523], 80.00th=[ 1205], 90.00th=[ 3752], 95.00th=[12256],
     | 99.00th=[16712], 99.50th=[16712], 99.90th=[16712], 99.95th=[16712],
     | 99.99th=[16712]
    bw (KB  /s): min= 3543, max=53894, per=23.36%, avg=19040.86, stdev=9744.06
    lat (msec) : 50=10.80%, 100=17.41%, 250=25.23%, 500=15.75%, 750=6.19%
    lat (msec) : 1000=3.00%, 2000=5.60%, >=2000=16.01%
  cpu          : usr=0.03%, sys=0.29%, ctx=9065, majf=0, minf=32861
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=1.3%, 32=97.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=4927/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_2: (groupid=5, jobs=4): err= 0: pid=8948: Wed Feb 28 13:36:48 2018
  read : io=5301.0MB, bw=86677KB/s, iops=84, runt= 62626msec
    slat (usec): min=62, max=6092, avg=209.68, stdev=165.10
    clat (msec): min=20, max=13693, avg=1507.46, stdev=3020.47
     lat (msec): min=20, max=13693, avg=1507.67, stdev=3020.47
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   40], 10.00th=[   52], 20.00th=[   81],
     | 30.00th=[  122], 40.00th=[  176], 50.00th=[  255], 60.00th=[  371],
     | 70.00th=[  644], 80.00th=[ 1549], 90.00th=[ 5014], 95.00th=[10683],
     | 99.00th=[12518], 99.50th=[12780], 99.90th=[13304], 99.95th=[13566],
     | 99.99th=[13698]
    bw (KB  /s): min= 4079, max=65536, per=25.72%, avg=22293.05, stdev=10870.81
    lat (msec) : 50=9.26%, 100=15.92%, 250=24.52%, 500=16.41%, 750=6.07%
    lat (msec) : 1000=3.77%, 2000=6.32%, >=2000=17.71%
  cpu          : usr=0.03%, sys=0.32%, ctx=9868, majf=0, minf=32856
  IO depths    : 1=0.1%, 2=0.2%, 4=0.3%, 8=0.6%, 16=1.2%, 32=97.7%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=5301/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=2393.0MB, aggrb=40809KB/s, minb=40809KB/s, maxb=40809KB/s, mint=60045msec, maxt=60045msec

Run status group 1 (all jobs):
   READ: io=1593.0MB, aggrb=27135KB/s, minb=27135KB/s, maxb=27135KB/s, mint=60114msec, maxt=60114msec

Run status group 2 (all jobs):
   READ: io=1934.0MB, aggrb=32995KB/s, minb=32995KB/s, maxb=32995KB/s, mint=60021msec, maxt=60021msec

Run status group 3 (all jobs):
   READ: io=6420.0MB, aggrb=103564KB/s, minb=103564KB/s, maxb=103564KB/s, mint=63478msec, maxt=63478msec

Run status group 4 (all jobs):
   READ: io=4927.0MB, aggrb=81503KB/s, minb=81503KB/s, maxb=81503KB/s, mint=61902msec, maxt=61902msec

Run status group 5 (all jobs):
   READ: io=5301.0MB, aggrb=86676KB/s, minb=86676KB/s, maxb=86676KB/s, mint=62626msec, maxt=62626msec